<template>
  <div>
    <ol class="introduction-list">
      <li
        :class="['introduction-item']"
        v-for="(item,i) in list"
        :key="i"
      >
        <div
          :class="['introduction-item-title','type'+(i+1)]"
        >
          <div class="num">{{('0'+(i+1)).substr(-2)}}</div>
          <div class="cnt">
            {{item.title}}
          </div>
        </div>
        <div class="introduction-item-cnt">
          {{item.cnt}}
        </div>
      </li>
    </ol>
  </div>
</template>

<script>
export default {
  name: 'Introduction',
  data () {
    return {
      list: [
        {
          title: '智慧城市安全展区 ',
          type: 1,
          cnt: '智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全，展区智慧城市安全展，区智慧城市安全展区智慧城市安全展区智;慧城市安全展区智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全展区智慧城市安全展区;智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全展区智慧城市安全展区，智慧城市安全展区智慧城市安全展区智慧城市安全展区。'
        },
        {
          title: '智慧城市安全展区 ',
          type: 2,
          cnt: '智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全，展区智慧城市安全展，区智慧城市安全展区智慧城市安全展区智;慧城市安全展区智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全展区智慧城市安全展区;智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全展区智慧城市安全展区，智慧城市安全展区智慧城市安全展区智慧城市安全展区。'
        },
        {
          title: '智慧城市安全展区 ',
          type: 3,
          cnt: '智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全，展区智慧城市安全展，区智慧城市安全展区智慧城市安全展区智;慧城市安全展区智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全展区智慧城市安全展区;智慧城市安全展区智慧城市安全展区。智慧城市安全展区智慧城市安全展区智慧城市安全展区智慧城市安全展区，智慧城市安全展区智慧城市安全展区智慧城市安全展区。'
        }
      ]
    };
  }
};
</script>

<style scoped>

</style>
